
INSERT INTO "department"
VALUES ('ТОП', 'Топ-менедмент', 'Руководители компании', null),
       ('ОУП', 'Отдель управления персоналом', '', null),
       ('ОИТ', 'Отдел информационных технологий', 'Саппорт', null),
       ('БУХ', 'Бухгалтерия', '', null),
       ('ФИН', 'Финансовый отдел', 'Закупки и управление бюджетом', null),
       ('ЛНК', 'Лаборатория неразрушающего контроля', '', null),
       ('УЦ', 'Учебный центр', '', null);


INSERT INTO "office"
VALUES (1, 'г. Санкт-Петербург, тер. Ольгино, ул. Вокзальная, д. 2, корп. 3, стр. 1', 200, 'Главный офис компании'),
       (2, 'г. Санкт-Петербург, переулок Пушкарский, дом 9, литера А, помещение 3‑Н, часть 1', 6, 'Экзаменационный центр');


INSERT INTO "personal_info"
VALUES (1, 'Озеров Алексей Артёмович', '1979-01-08', '2000-02-23', true),
       (2, 'Тарасова Софья Александровна', '1989-04-13', '2020-01-13', false),
       (3, 'Кравцов Илья Дмитриевич', '1965-07-18', '2012-12-03', true),
       (4, 'Никитин Святослав Тимофеевич', '1980-05-12', '2021-05-12', true),
       (5, 'Вавилов Артём Иванович', '1978-11-12', '2004-08-04', true),
       (6, 'Богомолов Лев Андреевич', '1997-06-30', '20024-08-01', true),
       (7, 'Колпакова Каролина Мироновна', '1995-06-12', '2023-07-14', false),
       (8, 'Васильев Глеб Максимович', '1979-05-23', '2016-02-07', true),
       (9, 'Мельников Никита Маркович', '1987-09-05', '2019-06-22', true),
       (10, 'Муравьева Карина Степановна', '1997-10-07', '2024-06-21', false);


INSERT INTO "employee"
VALUES (1, 1, 'Генеральный директор', null, 'ТОП', 1, 1111, '66a52bbad153b0189d3d4af0'),
       (2, 2, 'Главный бухгалтер', 1, 'БУХ', 1, 1112, '66a52bbad153b0189d3d4af1'),
       (3, 3, 'Руководитель лаборатории неразрущающего контроля', 1, 'ЛНК', 1, 2000, '66a52bbad153b0189d3d4af2'),
       (4, 4, 'Системный администратор', 1, 'ОИТ', 1, 3001, '66a52bbad153b0189d3d4af3'),
       (5, 5, 'Специалист по кадровой работе', 1, 'ОУП', 1, 4002, '66a52bbad153b0189d3d4af4'),
       (6, 6, 'Младший специалист лаборатории неразрущающего контроля ', 3, 'ЛНК', 1, null, '66a52bbad153b0189d3d4af5'),
       (7, 7, 'Офис-менеджер', 5, 'ОУП', 1, 4004, '66a52bbad153b0189d3d4af6'),
       (8, 8, 'Преподаватель трудовой безопастности', null, 'УЦ', 2, null, null),
       (9, 9, 'Охранник', null, 'УЦ', 2, 5000, null),
       (10, 10, 'Финансовый директор', 1, 'ФИН', null, 1112, '66a52bbad153b0189d3d4af9');


UPDATE "department" SET manager_id = 1 WHERE code = 'ТОП';
UPDATE "department" SET manager_id = 5 WHERE code = 'ОУП';
UPDATE "department" SET manager_id = 4 WHERE code = 'ОИТ';
UPDATE "department" SET manager_id = 2 WHERE code = 'БУХ';
UPDATE "department" SET manager_id = 10 WHERE code = 'ФИН';
UPDATE "department" SET manager_id = 3 WHERE code = 'ЛНК';
UPDATE "department" SET manager_id = 8 WHERE code = 'УЦ';
