
INSERT INTO "department"
VALUES ('ТОП', 'Топ-менедмент', 'Руководители компании'),
       ('ОУП', 'Отдель управления персоналом', ''),
       ('ОИТ', 'Отдел информационных технологий', 'Саппорт'),
       ('БУХ', 'Бухгалтерия', ''),
       ('ФИН', 'Финансовый отдел', 'Закупки и управление бюджетом'),
       ('ЛНК', 'Лаборатория неразрушающего контроля', ''),
       ('РП', 'Руководители проектов', ''),
       ('ЭТЛ', 'Электротехническая лаборатория', '');


INSERT INTO "office"
VALUES (1, 'г. Санкт-Петербург, тер. Ольгино, ул. Вокзальная, д. 2, корп. 3, стр. 1', 200, 'Главный офис компании'),
       (2, 'г. Санкт-Петербург, переулок Пушкарский, дом 9, литера А, помещение 3‑Н, часть 1', 6, 'Экзаменационный центр');

